rottenpotatoes/app/controllers/movies_controller.rb

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy!
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]